# Assignment 2

### Leveraging NoSQL functionality in a RDBMS

In our last lecturer we have discovered that we can easily blend json and sql data using PostgreSQL's JSONB datatype and its operators.

Part 1.) Now it's your task to provide some answers using the migrated json data. 

Part 2.) Ingest data from an external service. Import data from the New York Times API

## Part 1.) Query jtracks data

Now that we have received information from our 3rd party seller. We would like to evaluate the data and generate some reports.

### Most popular artists
_Which artists have been listened to most often and how often?_

In [3]:
%sql select jtracks.body->>'artist' artist, sum((jtracks.body->'count')::INT) total_count from jtracks group by artist order by total_count desc LIMIT 5;

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('David Osborne', 3926),
 ('Frank Sinatra', 1815),
 ('Bing Crosby', 934),
 ('AC/DC', 794),
 ('Led Zeppelin', 776)]

### Generate an invoice report

The "counts" field represents the number a specific track has been listened to.
Based on the pricing information in the tracks table, generate a report that calculates the total value per track.

One count equals one single order. 


Further Explanation: If the price of a single track is 0.99 and its count equals 10, the total equals 9.90.

In [4]:
%sql select jtracks.body->>'name' track_name, SUM(unit_price*(jtracks.body->>'count')::INT) total from jtracks join tracks on jtracks.body->>'name' = tracks.name group by track_name order by total desc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('Gone', Decimal('716.76')),
 ('Spanish Eyes', Decimal('371.25')),
 ('Stairway To Heaven', Decimal('276.21')),
 ('Fly Me To The Moon', Decimal('272.25')),
 ('Unchained Melody', Decimal('262.35'))]

### Most valued artists

Similar to the previous question but grouped by the corresponding artist: Using the some information in jtracks, group the total amount by the artist name.

Your result should look like:

| artist_name | total | 
|-------------|-------|
| AC/DC       | 312.23|
| Rammstein   | 200.21|
| Queens      |  33.12|

In [5]:
%sql select jtracks.body->>'artist' artist, SUM(unit_price*(jtracks.body->>'count')::INT) total from jtracks join tracks on jtracks.body->>'name' = tracks.name group by artist order by total desc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('Led Zeppelin', Decimal('1267.20')),
 ('Hollie Smith', Decimal('716.76')),
 ('David Osborne', Decimal('534.60')),
 ('La Esperanza', Decimal('371.25')),
 ('Queen', Decimal('323.73'))]

### Missing talent

There are some artists that are not in our music-store. Of those missing in our music-store, figure out the ones that should be signed us.

Query the top 5 artists that have the most total count and are not in our music store. Order your result descending.

In [6]:
%sql select jtracks.body->>'artist' artist_name, SUM((jtracks.body->>'count')::INT) total from jtracks where jtracks.body->>'artist' not in (select distinct artists.name from artists) group by artist_name order by total desc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('David Osborne', 3926),
 ('Bing Crosby', 934),
 ('Rammstein', 524),
 ('Bryan Lee', 481),
 ('Matt Ender', 463)]

## Part 2.) Data Ingestion from NYT API

We ask you to write an application that fetches data from the NYT API (https://developer.nytimes.com/apis) and subsequently run some queries against your dataset.
In order to be able to access the NYT API, you'll have to set up an account. After setting up your account, you should be able to fetch data from the REST API using the provided api key. 
In order to figure out how to provide answers to the following tasks, you'll have to work through to API documentation on your own.
You are allowed to use any python 3rd party libraries you want. Be sure to upload this notebook and your python source code + requirements.txt to moodle. 
Carefully think whether you want to store the whole data returned from an api request or only a fraction of it. 
You will either have to store the data in your docker database or in a custom database. (This will be decided by the end of the last lecture).

You shall provide the sql query that answers the following questions

### Number of most viewed
How many most viewed articles have been there within the last 30 days?

In [10]:
%sql select count(*) from ds22m029_nyt where url like '%viewed/30%'

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/nyt_import
1 rows affected.

[(20,)]

### Section and subsection of most viewed articles

Of all most viewed articles within the last 30 days, what where the numbers of articles per section and subsection?


Your result should look like the following:


| Section | subsection | number | 
|------------|---------|--------|
| U.S.       |Politics |5       |
| U.S.       |         |2       |
| Business   |         |3       |
| Opinion    |         |2       |

In [11]:
%sql select ds22m029_nyt.result->>'section' section, ds22m029_nyt.result->>'subsection' subsection, count(*) number from ds22m029_nyt where url like '%viewed/30%' group by (section, subsection) order by section desc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/nyt_import
5 rows affected.

[('U.S.', '', 5),
 ('U.S.', 'Politics', 1),
 ('Technology', '', 4),
 ('Style', '', 1),
 ('Sports', 'N.B.A.', 1)]

## Most viewed vs most shared

Of all most viewed and most shared sections, compare the number of shared and viewed articles per section within the last 30 days.


Your result shall look like the following: (notice '0' if a section does not occur within a type)


| Section    | type    | number | 
|------------|---------|--------|
| U.S.       |shared   |5       |
| U.S.       |viewed   |3       |
| Opinion    |shared   |2       | 
| Opinion    |viewed   |0       |

In [12]:
%sql select ds22m029_nyt.result->>'section' section, substring(url,'(shared|viewed)') type, count(*) number from ds22m029_nyt where url like '%mostpopular%' group by (section, type) order by number desc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/nyt_import
5 rows affected.

[('U.S.', 'shared', 12),
 ('U.S.', 'viewed', 6),
 ('Technology', 'viewed', 4),
 ('Arts', 'viewed', 3),
 ('Food', 'shared', 2)]

### Be creative

Last but not least, we want you to think of any interesting information you'd like to evaluate using the NYT API.
What kind of information might be interesting to know? - You don't need to put too much thought into the question you'd like to answer, but be creative!

There's only one catch! - You must use a different category, e.g. top stories, books, movies,...

The question you would like to answer =

Of all sections, which ones bring the most and least top stories.

In [13]:
%sql select substring(url,'topstories/v2/(.+).json') section, count(*) number from ds22m029_nyt where url like '%topstories%' group by section order by number desc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/nyt_import
5 rows affected.

[('automobiles', 39),
 ('food', 39),
 ('sports', 39),
 ('t-magazine', 38),
 ('realestate', 36)]

In [14]:
%sql select substring(url,'topstories/v2/(.+).json') section, count(*) number from ds22m029_nyt where url like '%topstories%' group by section order by number asc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/nyt_import
5 rows affected.

[('us', 24),
 ('opinion', 24),
 ('politics', 25),
 ('sundayreview', 25),
 ('science', 26)]